sai111-alt/stm32-code/10-1-Software read or write MPU6050/Hardware/MPU6050.h
#ifndef __MPU6050_H__
#define __MPU6050_H__

#include "stm32f10x.h" // Device header
#include "MyI2C.h"

#define MPU6050_ADDRESS 0xD0

#define MPU6050_SMPLRT_DIV 0x19
#define MPU6050_CONFIG 0x1A
#define MPU6050_GYRO_CONFIG 0x1B
#define MPU6050_ACCEL_CONFIG 0x1C

#define MPU6050_ACCEL_XOUT_H 0x3B
#define MPU6050_ACCEL_XOUT_L 0x3C
#define MPU6050_ACCEL_YOUT_H 0x3D
#define MPU6050_ACCEL_YOUT_L 0x3E
#define MPU6050_ACCEL_ZOUT_H 0x3F
#define MPU6050_ACCEL_ZOUT_L 0x40
#define MPU6050_TEMP_OUT_H 0x41
#define MPU6050_TEMP_OUT_L 0x42
#define MPU6050_GYRO_XOUT_H 0x43
#define MPU6050_GYRO_XOUT_L 0x44
#define MPU6050_GYRO_YOUT_H 0x45
#define MPU6050_GYRO_YOUT_L 0x46
#define MPU6050_GYRO_ZOUT_H 0x47
#define MPU6050_GYRO_ZOUT_L 0x48

#define MPU6050_PWR_MGMT_1 0x6B
#define MPU6050_PWR_MGMT_2 0x6C
#define MPU6050_WHO_AM_I 0x75

#define AccX AccGyro[0]
#define AccY AccGyro[1]
#define AccZ AccGyro[2]
#define GyroX AccGyro[3]
#define GyroY AccGyro[4]
#define GyroZ AccGyro[5]

void MPU6050_Init(void);
void MPU6050_GetData(int16_t *AccGyro);
uint8_t MPU6050_GetID(void);

#endif
